Revit 2027 API
CurtainSystem.AddCurtainGrid Method
Add CurtainGrid on the specified face for the CurtainSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddCurtainGrid(
	Reference face
)
Public Sub AddCurtainGrid (
	face As Reference
)
public:
void AddCurtainGrid(
	Reference^ face
)
member AddCurtainGrid :
        face : Reference -> unit
Parameters
face Reference
The face new CurtainGrid will be created on.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument face is null.
InvalidOperationException |  Thrown when creating CurtainGrid on the specified face fails or regenerate fails.
See Also
Reference
CurtainSystem Class
Autodesk.Revit.DB Namespace